Tekla Open API Reference for Tekla Structures 2025
IHideable Properties
The IHideable type exposes the following members.
Properties
Name | Description
Hideable
 Accesses the information if this object is hidden or not or if it should be.
Top
See Also
Reference
IHideable Interface
Tekla.Structures.Drawing Namespace